{"description":"They wished for a place that would remind them of Ireland, but would also incorporate a number of personal objects; a place where they could entertain friends, but also host them...","body":"<p>This stylish two bedroom apartment is the occasional house of a couple who lives in Ireland, but often comes to Romania for holidays and to visit their family and friends. They wished for a place that would remind them of Ireland, but would also incorporate a number of personal objects; a place where they could entertain friends, but also host them. This essentially set the coordinates for the project and established the interior decorating style as a combination of classic and country style with modern influences and Asian inspired elements.</p>\n<p>Despite the overall small surface, the layout of the apartment works in its advantage. The kitchen opens completely to the living room, creating the illusion of a single, large room, while the vestibule window adds plenty of light, making up for the lack of a proper kitchen window. Designed for a couple who loves to cook and entertain guests, the kitchen combines the elegance of classic style with modern, built-in appliances. As a plus, the expandable table can accommodate up to ten people. A tall, open cabinet displaying the drinks makes the transition to the living room, where a large corner sofa, which can turn into a bed, stuffed with lots of cushions, makes you want to snuggle and relax. Pale colours and floral patterns add a feminine touch. The two pictures and the large, black recliner are some of the original objects in the apartment.</p>\n<p>The bedrooms, both quite small, are decorated in opposite styles. The feminine master bedroom is dressed with light and warm colours, natural fabrics, white, slender furniture and an upholstered bed. The chic table lamps, which belong to the owners, and the gorgeous star-burst mirrors complete the romantic mood. Sliding dressing doors save a lot of space and the mirrors enhance the room. The second bedroom is a boys play-and-work space. A beautiful “Arte Povera” dresser, another of the owners’ personal objects, sets the decorating style, but the room is designed for multiple uses. You can either work on the computer, watch TV with a couple of buddies, take a nap or even expand the sofa for a comfortable sleep.</p>\n<p>There are still a few matters to be addressed, however, given the fact that this looks quite different from my previous work, I decided to post the pictures in advance.</p>\n<div class=\"pics\">\n![Kitchen 1](jpg)\n![Kitchen 2](jpg)\n![Living 1](jpg)\n![Living 2](jpg)\n![Living 3](jpg)\n![Living 4](jpg)\n![Living 5A](jpg)\n![Living 5B](jpg)\n![Bedroom 3](jpg)\n![Bedroom 2](jpg)\n![Bedroom 4](jpg)\n![Bedroom 1](jpg)\n![Study 1](jpg)\n![Study 2](jpg)\n![Study 3](jpg)\n![Study 4](jpg)\n</div>\n","gallery":["charming-mixture-kitchen-1.jpg","charming-mixture-kitchen-2.jpg","charming-mixture-living-1.jpg","charming-mixture-living-2.jpg","charming-mixture-living-3.jpg","charming-mixture-living-4.jpg","charming-mixture-living-5a.jpg","charming-mixture-living-5b.jpg","charming-mixture-bedroom-3.jpg","charming-mixture-bedroom-2.jpg","charming-mixture-bedroom-4.jpg","charming-mixture-bedroom-1.jpg","charming-mixture-study-1.jpg","charming-mixture-study-2.jpg","charming-mixture-study-3.jpg","charming-mixture-study-4.jpg"]}